; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v1 ?v7)
             (pred_9 ?v11 ?v10)
             (pred_3 ?v1 ?v10)
             (pred_10 ?v12 ?v1 )
	     (pred_11 ?v1)
             (pred_6 ?v9)
             (pred_2 ?v11)
             (pred_4 ?v10)
             (pred_12 ?v1)
             (pred_5 ?v11)
             (pred_8 ?v1)
             (pred_7 ))



(:action op_3
:parameters (?v4 ?v2 ?v5 ?v6)
:precondition (and (pred_6 ?v4) (pred_6 ?v2) (pred_2 ?v5) (pred_4 ?v6)
          (pred_1 ?v4 ?v2) (pred_9 ?v5 ?v6)
                   (pred_3 ?v2 ?v6) (pred_11 ?v4) 
                   (pred_12 ?v2) (pred_5 ?v5))
:effect (and  (pred_8 ?v2) (not (pred_12 ?v2))))


(:action op_2
:parameters (?v4 ?v3)
:precondition (and (pred_6 ?v4) (pred_6 ?v3)
               (pred_11 ?v4) (pred_1 ?v4 ?v3) (pred_8 ?v3))
:effect (and (pred_11 ?v3) (not (pred_11 ?v4))))

(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_6 ?v4) (pred_2 ?v5) 
                  (pred_11 ?v4) (pred_10 ?v5 ?v4) (pred_7 ))
:effect (and (pred_5 ?v5)
   (not (pred_10 ?v5 ?v4)) (not (pred_7 ))))


(:action op_4
:parameters (?v4 ?v8 ?v13)
:precondition (and (pred_6 ?v4) (pred_2 ?v8) (pred_2 ?v13)
                  (pred_11 ?v4) (pred_5 ?v13) (pred_10 ?v8 ?v4))
:effect (and (pred_5 ?v8) (pred_10 ?v13 ?v4)
        (not (pred_5 ?v13)) (not (pred_10 ?v8 ?v4))))

(:action op_5
:parameters (?v4 ?v5)
:precondition (and (pred_6 ?v4) (pred_2 ?v5) 
                  (pred_11 ?v4) (pred_5 ?v5))
:effect (and (pred_7 ) (pred_10 ?v5 ?v4) (not (pred_5 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_08 obj_03 obj_20 obj_22 obj_13 obj_04 obj_19 obj_16 obj_02 obj_07 obj_01 obj_18 obj_05 obj_15 obj_14
    obj_17 obj_21 obj_09
    obj_10 obj_06 obj_12
    )

    (:init
       (pred_7)

       (pred_6 obj_11)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_04)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_6 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_15)
       (pred_6 obj_14)
       (pred_4 obj_17)
       (pred_4 obj_21)
       (pred_4 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_12)

       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_20 obj_19)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_19 obj_01)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_16 obj_02)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_02 obj_05)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_16)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_19)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_05 obj_02)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_19)
       (pred_12 obj_01)
       (pred_3  obj_14 obj_17)
       (pred_3  obj_19 obj_21)
       (pred_3  obj_01 obj_09)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_8 obj_07)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_15)

       (pred_9  obj_10 obj_17)
       (pred_9  obj_06 obj_21)
       (pred_9  obj_12 obj_09)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_12 obj_08)
       (pred_11 obj_18)
    )

    (:goal (and
       (pred_10 obj_06 obj_02)
       (pred_10 obj_12 obj_22)
    ))
(:constraints
  (always (not (pred_11 obj_16)))
)
)

; plan
1. (op_2 obj_18 obj_05)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_05)
   goals met: 0 of 2
2. (op_2 obj_05 obj_02)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_02)
   goals met: 0 of 2
3. (op_2 obj_02 obj_13)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_13)
   goals met: 0 of 2
4. (op_1 obj_13 obj_06)
   deleted: (pred_10 obj_06 obj_13) (pred_7)
   added: (pred_5 obj_06)
   goals met: 0 of 2
5. (op_2 obj_13 obj_02)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_02)
   goals met: 0 of 2
6. (op_5 obj_02 obj_06)
   deleted: (pred_5 obj_06)
   added: (pred_7) (pred_10 obj_06 obj_02)
   goals met: 1 of 2
7. (op_2 obj_02 obj_13)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_13)
   goals met: 1 of 2
8. (op_2 obj_13 obj_08)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_08)
   goals met: 1 of 2
9. (op_1 obj_08 obj_12)
   deleted: (pred_10 obj_12 obj_08) (pred_7)
   added: (pred_5 obj_12)
   goals met: 1 of 2
10. (op_2 obj_08 obj_11)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_11)
   goals met: 1 of 2
11. (op_2 obj_11 obj_22)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_22)
   goals met: 1 of 2
12. (op_5 obj_22 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_7) (pred_10 obj_12 obj_22)
   goals met: 2 of 2
